jeanne_web/app/views/medications/_medication.slim

	        .item.label Take
	        = select(:medication, :amount, (1..100).to_a, {:include_blank => true},{class: 'item'})
---
SELECT  "medications".* FROM "medications"   ORDER BY "medications"."id" ASC LIMIT 1