jeanne_web/app/controllers/application_controller.rb

SELECT  "caregivers".* FROM "caregivers"  WHERE "caregivers"."username" IS NULL LIMIT 1
---
    def login

        if params
            @username = params[:username]
            @password = params[:password]
            caregiver = Caregiver.find_by_username(@username)

SELECT  "caregivers".* FROM "caregivers"   ORDER BY "caregivers"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "caregivers"
DELETE FROM "caregivers" WHERE "caregivers"."id" = ?  [["id", 1]]
SELECT  "patients".* FROM "patients"   ORDER BY "patients"."id" ASC LIMIT 1
DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 1]]
SELECT "medications".* FROM "medications"
INSERT INTO "patients" ("birthdate", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["birthdate", "1930-12-12"], ["created_at", "2015-01-10 02:46:10.763087"], ["name", "Cara Jeanne"], ["updated_at", "2015-01-10 02:46:10.763087"]]
INSERT INTO "caregivers" ("created_at", "email", "password", "patient_id", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-01-10 02:52:30.481214"], ["email", "aprowe@ucsc.edu"], ["password", "1"], ["patient_id", 2], ["updated_at", "2015-01-10 02:52:30.481214"], ["username", "Alex"]]
---
    def init
        if Caregiver.all.count > 1
            Caregiver.all.each do |giver|
                giver.destroy
            end

            Patient.all.each do |patients|
                patients.destroy
            end

            Medication.all.each do |patients|
                patients.destroy
            end

        end

        patient = Patient.new
        patient.name = "Cara Jeanne"
        patient.birthdate = '12/12/1930'.to_date
        patient.save

        caregiver = Caregiver.new
        caregiver.username = 'Alex'
        caregiver.password = '1'
        caregiver.email= 'aprowe@ucsc.edu'
        caregiver.patient = patient
        caregiver.save

INSERT INTO "medications" ("amount", "created_at", "days", "description", "name", "patient_id", "times", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
        medication.days = [0,1,2,3,4,5,6,7].to_json
        medication.patient = patient
        medication.amount = 2
        medication.save