jeanne_web/app/controllers/application_controller.rb

SELECT "alerts".* FROM "alerts"
---
    def init
        if Caregiver.all.count > 1
            Caregiver.all.each do |giver|
                giver.destroy
            end

            Patient.all.each do |patients|
                patients.destroy
            end

            Medication.all.each do |patients|
                patients.destroy
            end

            Alert.all.each do |patients|

INSERT INTO "alerts" ("created_at", "message", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-01-11 06:39:52.554261"], ["message", "Your patient need your attention"], ["updated_at", "2015-01-11 06:39:52.554261"]]
---

        alert = Alert.new
        alert.message = 'Your patient need your attention'
        alert.save