jeanne_web/app/controllers/medications_controller.rb

	def create
		@medication = Medication.new

		@medication.amount = params[:medication][:amount]
		@medication.name = params[:medication][:name]
		@medication.days = params[:medication][:days]
		@medication.times = [params[:medication][:times]].to_json
		@medication.patient_id = params[:medication][:patient_id]
		@medication.save
---
INSERT INTO "medications" ("created_at", "days", "name", "patient_id", "time", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-01-11 06:22:00.709597"], ["days", "[1,3,5]"], ["name", "Blue Box"], ["patient_id", 9], ["time", "2000-01-01 14:30:00.000000"], ["updated_at", "2015-01-11 06:22:00.709597"]]

	def delete
		medication = Medication.find params[:id]
		medication.destroy!
---
SELECT  "medications".* FROM "medications"  WHERE "medications"."id" = ? LIMIT 1  [["id", 9]]
DELETE FROM "medications" WHERE "medications"."id" = ?  [["id", 9]]