jeanne_web/app/controllers/patients_controller.rb

	def today
		str = ''
		Patient.first.medications.order('time asc').each do |med|
---
SELECT "medications".* FROM "medications"  WHERE "medications"."patient_id" = ?  ORDER BY time asc  [["patient_id", 9]]

	def delete_alert
		alert = Alert.find(params[:id])
		alert.delete
---
SELECT  "alerts".* FROM "alerts"  WHERE "alerts"."id" = ? LIMIT 1  [["id", 11]]
DELETE FROM "alerts" WHERE "alerts"."id" = 11

	def create_alert
		alert = Alert.new
		alert.message = params[:message]
		alert.save
---
INSERT INTO "alerts" ("created_at", "message", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-01-11 03:33:34.464702"], ["message", "hi"], ["updated_at", "2015-01-11 03:33:34.464702"]]

	def get_alerts


		id = params[:id]

		Alert.all.each do | alert |
---
SELECT "alerts".* FROM "alerts"