jeanne_web/app/views/application/home.slim

#left-content
	= render Patient.first
---
SELECT  "patients".* FROM "patients"   ORDER BY "patients"."id" ASC LIMIT 1

				ul#medication-list
			        - @patient.medications.each do | med |
---
SELECT "medications".* FROM "medications"